_orgs/_posts/algorithms/2018-06-12-encrypt.org
#+TITLE:     加密算法
#+AUTHOR:    Zhao Rengui
#+EMAIL:     zrg1390556487@gmail.com
#+LANGUAGE:  cn
#+OPTIONS:   H:3 num:nil toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:plain toc:t ltoc:t mouse:underline buttons:0 path:http://cs3.swfc.edu.cn/~20121156044/.org-info.js />
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://cs3.swfu.edu.cn/~20121156044/.org-manual.css" />
#+HTML_HEAD: <style>body {font-size:14pt} code {font-weight:bold;font-size:100%; color:darkblue}</style>
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:

#+BEGIN_EXPORT HTML
---
layout: post
title: 加密算法
author: zrg
comments: false
description: 加密算法介绍
categories:
- Algorithms
tags:
- encrypt
photos:
---
#+END_EXPORT
 
# (setq org-export-html-use-infojs nil)
# (setq org-export-html-style nil)

* 前言
: 加密算法是密码技术的核心，有些算法已经遭到破译，有些安全度不高，有些强度不明，有些待进—步分析，有些需要深入
: 研究，而神秘的加密算法世界，又会有新的成员加入，期待更安全的算法诞生。
* 对称加密算法
** 说明
: 在对称加密算法中，加密使用的密钥和解密使用的密钥是相同的。也就是说，加密和解密都是使用的同一个密钥。因此对称
: 加密算法要保证安全性的话，密钥要做好保密，只能让使用的人知道，不能对外公开。

: 「密钥」，一般就是一个字符串或数字，在加密或者解密时传递给加密/解密算法。

: 常见的对称加密算法：DES、3DES、DESX、Blowfish、IDEA、RC4、RC5、RC6和AES
** AES
*** 简介
 : AES加密算法是密码学中的高级加密标准，该加密算法采用对称分组密码体制，密钥长度的最少支持为128、192、256，
 : 分组长度128位，算法应易于各种硬件和软件实现。这种加密算法是美国联邦政府采用的区块加密标准，这个标准用来替
 : 代原先的DES，已经被多方分析且广为全世界所使用。

 : AES加密算法被设计为支持128／192／256位（/32=nb)数据块大小（即分组长度）；支持128／192／256位（/32=nk)
: 密码长度，在10进制里，对应34×1038、62×1057、1.1×1077个密钥。
** DES
*** 简介
 : DES加密算法是一种分组密码，以64位为分组对数据加密，它的密钥长度是56位，加密解密用同一算法。

 : DES加密算法是对密钥进行保密，而公开算法，包括加密和解密算法。这样，只有掌握了和发送方相同密钥的人才能解读
 : 由DES加密算法加密的密文数据。因此，破译DES加密算法实际上就是搜索密钥的编码。

 : 对于56位长度的密钥来说，如果用穷举法来进行搜索的话，其运算次数为256。随着计算机系统能力的不断发展，DES的安
 : 全性比它刚出现时会弱得多，然而从非关键性质的实际出发，仍可以认为它是足够的。不过，DES现在仅用于旧系统的鉴
 : 定，而更多地选择新的加密标准。
*** C# Code
 #+BEGIN_SRC emacs-lisp
 #region DES加密解密
 /// <summary>
 /// DES加密
 /// </summary>
 /// <param name="data">加密数据</param>
 /// <param name="key">8位字符的密钥字符串</param>
 /// <param name="iv">8位字符的初始化向量字符串</param>
 /// <returns></returns>
 public static string DESEncrypt(string data, string key, string iv)
 {
     byte[] byKey = System.Text.ASCIIEncoding.ASCII.GetBytes(key);
     byte[] byIV = System.Text.ASCIIEncoding.ASCII.GetBytes(iv);
    
     DESCryptoServiceProvider cryptoProvider = new DESCryptoServiceProvider();
     int i = cryptoProvider.KeySize;
     MemoryStream ms = new MemoryStream();
     CryptoStream cst = new CryptoStream(ms, cryptoProvider.CreateEncryptor(byKey, byIV), CryptoStreamMode.Write);
 
     StreamWriter sw = new StreamWriter(cst);
     sw.Write(data);
     sw.Flush();
     cst.FlushFinalBlock();
     sw.Flush();
     return Convert.ToBase64String(ms.GetBuffer(), 0, (int)ms.Length);
 }

 /// <summary>
 /// DES解密
 /// </summary>
 /// <param name="data">解密数据</param>
 /// <param name="key">8位字符的密钥字符串(需要和加密时相同)</param>
 /// <param name="iv">8位字符的初始化向量字符串(需要和加密时相同)</param>
 /// <returns></returns>
 public static string DESDecrypt(string data, string key, string iv)
 {
     byte[] byKey = System.Text.ASCIIEncoding.ASCII.GetBytes(key);
     byte[] byIV = System.Text.ASCIIEncoding.ASCII.GetBytes(iv);
    
     byte[] byEnc;
     try
     {
         byEnc = Convert.FromBase64String(data);
     }
     catch
     {
         return null;
     }
    
     DESCryptoServiceProvider cryptoProvider = new DESCryptoServiceProvider();
     MemoryStream ms = new MemoryStream(byEnc);
     CryptoStream cst = new CryptoStream(ms, cryptoProvider.CreateDecryptor(byKey, byIV), CryptoStreamMode.Read);
     StreamReader sr = new StreamReader(cst);
     return sr.ReadToEnd();
 }
 #endregion
 #+END_SRC
** 3DES
*** C# Code
 #+BEGIN_SRC emacs-lisp
 #region 3DES 加密解密
 public static string DES3Encrypt(string data, string key)
 {
    TripleDESCryptoServiceProvider DES = new TripleDESCryptoServiceProvider();
   
    DES.Key = ASCIIEncoding.ASCII.GetBytes(key);
    DES.Mode = CipherMode.CBC;
    DES.Padding = PaddingMode.PKCS7;
   
    ICryptoTransform DESEncrypt = DES.CreateEncryptor();
   
    byte[] Buffer = ASCIIEncoding.ASCII.GetBytes(data);
    return Convert.ToBase64String(DESEncrypt.TransformFinalBlock(Buffer, 0, Buffer.Length));
 }

 public static string DES3Decrypt(string data, string key)
 {
     TripleDESCryptoServiceProvider DES = new TripleDESCryptoServiceProvider();
 
     DES.Key = ASCIIEncoding.ASCII.GetBytes(key);
     DES.Mode = CipherMode.CBC;
     DES.Padding = System.Security.Cryptography.PaddingMode.PKCS7;
    
     ICryptoTransform DESDecrypt = DES.CreateDecryptor();
    
     string result = "";
     try
     {
         byte[] Buffer = Convert.FromBase64String(data);
         result = ASCIIEncoding.ASCII.GetString(DESDecrypt.TransformFinalBlock(Buffer, 0, Buffer.Length));
     }
     catch (Exception e)
     {
    
     }
     return result;
 }
 #endregion
 #+END_SRC
* 非对称加密算法
** 说明
: 非对称加密算法采用「公钥密码体制(public-key cryptography)」，公钥密码体制分为三部分公钥、私钥、加密解密算法，
: 它的加密解密过程如下： 
- 加密：通过加密算法和公钥对内容(或者说明文)进行加密，得到密文。加密过程需要用到公钥。 
- 解密：通过解密算法和私钥对密文进行解密，得到明文。解密过程需要用到解密算法和私钥。注意，由公钥加密的内容，只能由私钥进行解密，也就是说，由公钥加密的内容，如果不知道私钥，是无法解密的。 
: 公钥密码体制的公钥和算法都是公开的(这是为什么叫公钥密码体制的原因)，私钥是保密的。大家都以使用公钥进行加密，
: 但是只有私钥的持有者才能解密。在实际的使用中，有需要的人会生成一对公钥和私钥，把公钥发布出去给别人使用，自
: 己保留私钥。

: 常见的非对称加密算法：RSA、ECC（移动设备用）、Diffie-Hellman、El Gamal、DSA（数字签名用）
** RSA
