_posts/algorithms/2018-06-12-encrypt.html
---
layout: post
title: 加密算法
author: zrg
comments: false
description: 加密算法介绍
categories:
- algorithms
tags:
- Encrypt
- 加密
photos:
---

<div id="outline-container-org635d0b2" class="outline-2">
<h2 id="org635d0b2">前言</h2>
<div class="outline-text-2" id="text-org635d0b2">
<pre class="example">
加密算法是密码技术的核心，有些算法已经遭到破译，有些安全度不高，有些强度不明，有些待进—步分析，有些需要深入
研究，而神秘的加密算法世界，又会有新的成员加入，期待更安全的算法诞生。

</pre>
</div>
</div>
<div id="outline-container-orgb094dd8" class="outline-2">
<h2 id="orgb094dd8">对称加密算法</h2>
<div class="outline-text-2" id="text-orgb094dd8">
</div>
<div id="outline-container-org528fdb4" class="outline-3">
<h3 id="org528fdb4">说明</h3>
<div class="outline-text-3" id="text-org528fdb4">
<pre class="example">
在对称加密算法中，加密使用的密钥和解密使用的密钥是相同的。也就是说，加密和解密都是使用的同一个密钥。因此对称
加密算法要保证安全性的话，密钥要做好保密，只能让使用的人知道，不能对外公开。

</pre>

<pre class="example">
「密钥」，一般就是一个字符串或数字，在加密或者解密时传递给加密/解密算法。

</pre>

<pre class="example">
常见的对称加密算法：DES、3DES、DESX、Blowfish、IDEA、RC4、RC5、RC6和AES

</pre>
</div>
</div>
<div id="outline-container-orgc740492" class="outline-3">
<h3 id="orgc740492">AES</h3>
<div class="outline-text-3" id="text-orgc740492">
</div>
<div id="outline-container-org3d8e803" class="outline-4">
<h4 id="org3d8e803">简介</h4>
<div class="outline-text-4" id="text-org3d8e803">
<pre class="example">
AES加密算法是密码学中的高级加密标准，该加密算法采用对称分组密码体制，密钥长度的最少支持为128、192、256，
分组长度128位，算法应易于各种硬件和软件实现。这种加密算法是美国联邦政府采用的区块加密标准，这个标准用来替
代原先的DES，已经被多方分析且广为全世界所使用。

</pre>

<pre class="example">
AES加密算法被设计为支持128／192／256位（/32=nb)数据块大小（即分组长度）；支持128／192／256位（/32=nk)
密码长度，在10进制里，对应34×1038、62×1057、1.1×1077个密钥。

</pre>
</div>
</div>
</div>
<div id="outline-container-orgcdd8c19" class="outline-3">
<h3 id="orgcdd8c19">DES</h3>
<div class="outline-text-3" id="text-orgcdd8c19">
</div>
<div id="outline-container-org13f2f5c" class="outline-4">
<h4 id="org13f2f5c">简介</h4>
<div class="outline-text-4" id="text-org13f2f5c">
<pre class="example">
DES加密算法是一种分组密码，以64位为分组对数据加密，它的密钥长度是56位，加密解密用同一算法。

</pre>

<pre class="example">
DES加密算法是对密钥进行保密，而公开算法，包括加密和解密算法。这样，只有掌握了和发送方相同密钥的人才能解读
由DES加密算法加密的密文数据。因此，破译DES加密算法实际上就是搜索密钥的编码。

</pre>

<pre class="example">
对于56位长度的密钥来说，如果用穷举法来进行搜索的话，其运算次数为256。随着计算机系统能力的不断发展，DES的安
全性比它刚出现时会弱得多，然而从非关键性质的实际出发，仍可以认为它是足够的。不过，DES现在仅用于旧系统的鉴
定，而更多地选择新的加密标准。

</pre>
</div>
</div>
<div id="outline-container-org122d726" class="outline-4">
<h4 id="org122d726">C# Code</h4>
<div class="outline-text-4" id="text-org122d726">
<div class="org-src-container">
<pre class="src src-emacs-lisp">#region DES&#21152;&#23494;&#35299;&#23494;
/// &lt;summary&gt;
/// DES&#21152;&#23494;
/// &lt;/summary&gt;
/// &lt;param name=<span style="color: #8b2252;">"data"</span>&gt;&#21152;&#23494;&#25968;&#25454;&lt;/param&gt;
/// &lt;param name=<span style="color: #8b2252;">"key"</span>&gt;8&#20301;&#23383;&#31526;&#30340;&#23494;&#38053;&#23383;&#31526;&#20018;&lt;/param&gt;
/// &lt;param name=<span style="color: #8b2252;">"iv"</span>&gt;8&#20301;&#23383;&#31526;&#30340;&#21021;&#22987;&#21270;&#21521;&#37327;&#23383;&#31526;&#20018;&lt;/param&gt;
/// &lt;returns&gt;&lt;/returns&gt;
public static string DESEncrypt(string data, string key, string iv)
{
    byte[] byKey = System.Text.ASCIIEncoding.ASCII.GetBytes(key)<span style="color: #b22222;">;</span>
    byte[] byIV = System.Text.ASCIIEncoding.ASCII.GetBytes(iv)<span style="color: #b22222;">;</span>

    DESCryptoServiceProvider cryptoProvider = new DESCryptoServiceProvider()<span style="color: #b22222;">;</span>
    int i = cryptoProvider.KeySize<span style="color: #b22222;">;</span>
    MemoryStream ms = new MemoryStream()<span style="color: #b22222;">;</span>
    CryptoStream cst = new CryptoStream(ms, cryptoProvider.CreateEncryptor(byKey, byIV), CryptoStreamMode.Write)<span style="color: #b22222;">;</span>

    StreamWriter sw = new StreamWriter(cst)<span style="color: #b22222;">;</span>
    sw.Write(data)<span style="color: #b22222;">;</span>
    sw.Flush()<span style="color: #b22222;">;</span>
    cst.FlushFinalBlock()<span style="color: #b22222;">;</span>
    sw.Flush()<span style="color: #b22222;">;</span>
    return Convert.ToBase64String(ms.GetBuffer(), 0, (int)ms.Length)<span style="color: #b22222;">;</span>
}

/// &lt;summary&gt;
/// DES&#35299;&#23494;
/// &lt;/summary&gt;
/// &lt;param name=<span style="color: #8b2252;">"data"</span>&gt;&#35299;&#23494;&#25968;&#25454;&lt;/param&gt;
/// &lt;param name=<span style="color: #8b2252;">"key"</span>&gt;8&#20301;&#23383;&#31526;&#30340;&#23494;&#38053;&#23383;&#31526;&#20018;(&#38656;&#35201;&#21644;&#21152;&#23494;&#26102;&#30456;&#21516;)&lt;/param&gt;
/// &lt;param name=<span style="color: #8b2252;">"iv"</span>&gt;8&#20301;&#23383;&#31526;&#30340;&#21021;&#22987;&#21270;&#21521;&#37327;&#23383;&#31526;&#20018;(&#38656;&#35201;&#21644;&#21152;&#23494;&#26102;&#30456;&#21516;)&lt;/param&gt;
/// &lt;returns&gt;&lt;/returns&gt;
public static string DESDecrypt(string data, string key, string iv)
{
    byte[] byKey = System.Text.ASCIIEncoding.ASCII.GetBytes(key)<span style="color: #b22222;">;</span>
    byte[] byIV = System.Text.ASCIIEncoding.ASCII.GetBytes(iv)<span style="color: #b22222;">;</span>

    byte[] byEnc<span style="color: #b22222;">;</span>
    try
    {
        byEnc = Convert.FromBase64String(data)<span style="color: #b22222;">;</span>
    }
    catch
    {
        return null<span style="color: #b22222;">;</span>
    }

    DESCryptoServiceProvider cryptoProvider = new DESCryptoServiceProvider()<span style="color: #b22222;">;</span>
    MemoryStream ms = new MemoryStream(byEnc)<span style="color: #b22222;">;</span>
    CryptoStream cst = new CryptoStream(ms, cryptoProvider.CreateDecryptor(byKey, byIV), CryptoStreamMode.Read)<span style="color: #b22222;">;</span>
    StreamReader sr = new StreamReader(cst)<span style="color: #b22222;">;</span>
    return sr.ReadToEnd()<span style="color: #b22222;">;</span>
}
#endregion
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgec6ccc9" class="outline-3">
<h3 id="orgec6ccc9">3DES</h3>
<div class="outline-text-3" id="text-orgec6ccc9">
</div>
<div id="outline-container-org5106bb6" class="outline-4">
<h4 id="org5106bb6">C# Code</h4>
<div class="outline-text-4" id="text-org5106bb6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">#region 3DES &#21152;&#23494;&#35299;&#23494;
public static string DES3Encrypt(string data, string key)
{
   TripleDESCryptoServiceProvider DES = new TripleDESCryptoServiceProvider()<span style="color: #b22222;">;</span>

   DES.Key = ASCIIEncoding.ASCII.GetBytes(key)<span style="color: #b22222;">;</span>
   DES.Mode = CipherMode.CBC<span style="color: #b22222;">;</span>
   DES.Padding = PaddingMode.PKCS7<span style="color: #b22222;">;</span>

   ICryptoTransform DESEncrypt = DES.CreateEncryptor()<span style="color: #b22222;">;</span>

   byte[] Buffer = ASCIIEncoding.ASCII.GetBytes(data)<span style="color: #b22222;">;</span>
   return Convert.ToBase64String(DESEncrypt.TransformFinalBlock(Buffer, 0, Buffer.Length))<span style="color: #b22222;">;</span>
}

public static string DES3Decrypt(string data, string key)
{
    TripleDESCryptoServiceProvider DES = new TripleDESCryptoServiceProvider()<span style="color: #b22222;">;</span>

    DES.Key = ASCIIEncoding.ASCII.GetBytes(key)<span style="color: #b22222;">;</span>
    DES.Mode = CipherMode.CBC<span style="color: #b22222;">;</span>
    DES.Padding = System.Security.Cryptography.PaddingMode.PKCS7<span style="color: #b22222;">;</span>

    ICryptoTransform DESDecrypt = DES.CreateDecryptor()<span style="color: #b22222;">;</span>

    string result = <span style="color: #8b2252;">""</span><span style="color: #b22222;">;</span>
    try
    {
        byte[] Buffer = Convert.FromBase64String(data)<span style="color: #b22222;">;</span>
        result = ASCIIEncoding.ASCII.GetString(DESDecrypt.TransformFinalBlock(Buffer, 0, Buffer.Length))<span style="color: #b22222;">;</span>
    }
    catch (Exception e)
    {

    }
    return result<span style="color: #b22222;">;</span>
}
#endregion
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd83c5d5" class="outline-2">
<h2 id="orgd83c5d5">非对称加密算法</h2>
<div class="outline-text-2" id="text-orgd83c5d5">
</div>
<div id="outline-container-orga40eb8b" class="outline-3">
<h3 id="orga40eb8b">说明</h3>
<div class="outline-text-3" id="text-orga40eb8b">
<pre class="example">
非对称加密算法采用「公钥密码体制(public-key cryptography)」，公钥密码体制分为三部分公钥、私钥、加密解密算法，
它的加密解密过程如下： 

</pre>
<ul class="org-ul">
<li>加密：通过加密算法和公钥对内容(或者说明文)进行加密，得到密文。加密过程需要用到公钥。</li>
<li>解密：通过解密算法和私钥对密文进行解密，得到明文。解密过程需要用到解密算法和私钥。注意，由公钥加密的内容，只能由私钥进行解密，也就是说，由公钥加密的内容，如果不知道私钥，是无法解密的。</li>
</ul>
<pre class="example">
公钥密码体制的公钥和算法都是公开的(这是为什么叫公钥密码体制的原因)，私钥是保密的。大家都以使用公钥进行加密，
但是只有私钥的持有者才能解密。在实际的使用中，有需要的人会生成一对公钥和私钥，把公钥发布出去给别人使用，自
己保留私钥。

</pre>

<pre class="example">
常见的非对称加密算法：RSA、ECC（移动设备用）、Diffie-Hellman、El Gamal、DSA（数字签名用）

</pre>
</div>
</div>
