_posts/algorithms/2018-06-12-encrypt.html
<div id="outline-container-org56e769b" class="outline-3">
<h3 id="org56e769b">RSA</h3>
<div class="outline-text-3" id="text-org56e769b">
</div>
<div id="outline-container-orgfc48800" class="outline-4">
<h4 id="orgfc48800">简介</h4>
<div class="outline-text-4" id="text-orgfc48800">
<pre class="example">
RSA(Rivest–Shamir–Adleman)加密算法是目前最有影响力的公钥加密算法，并且被普遍认为是目前最优秀的公钥方案之一。
RSA是第一个能同时用于加密和数宇签名的算法，它能够抵抗到目前为止已知的所有密码攻击，已被ISO推荐为公钥数据加密标准。

</pre>

<pre class="example">
RSA加密算法基于一个十分简单的数论事实：将两个大素数相乘十分容易，但那时想要对其乘积进行因式分解却极其困难，因此可
以将乘积公开作为加密密钥。

</pre>

<pre class="example">
RSA密码体制是一种公钥密码体制，公钥公开，私钥保密，它的加密解密算法是公开的。 由公钥加密的内容可以并且只能由私钥
进行解密，并且由私钥加密的内容可以并且只能由公钥进行解密。也就是说，RSA的这一对公钥、私钥都可以用来加密和解密，并
且一方加密的内容可以由并且只能由对方进行解密。

</pre>

<pre class="example">
「签名」，签名就是在信息的后面再加上一段内容，可以证明信息没有被修改过，怎么样可以达到这个效果呢？
一般是对信息做一个hash计算得到一个hash值，注意，这个过程是不可逆的，也就是说无法通过hash值得出原来的信息内容。
再把信息发送出去时，把这个hash值加密后做为一个签名和信息一起发出去。 接收方在收到信息后，会重新计算信息的hash值，
并和信息所附带的hash值(解密后)进行对比，如果一致，就说明信息的内容没有被修改过，因为这里hash计算可以保证不同的内
容一定会得到不同的hash值，所以只要内容一被修改，根据信息内容计算的hash值就会变化。
当然，不怀好意的人也可以修改信息内容的同时也修改hash值，从而让它们可以相匹配，为了防止这种情况，hash值一般都会加
密后(也就是签名)再和信息一起发送，以保证这个hash值不被修改。至于如何让别人可以解密这个签名，这个过程涉及到数字证
书等概念。

</pre>

<pre class="example">
举例说明：外部系统（B）调用核心系统（A）接口时，需通过非对称加密算法解决安全上的问题，如伪装调用、模拟调用等。
（此例通过公钥加密，私钥解密的方式） 

</pre>
<ol class="org-ol">
<li>首先，在A端生成密钥对，得到public_key.pem，private_key.pem。（生成密钥对方法参考：<a href="https://www.cnblogs.com/taoshihan/p/6340854.html">https://www.cnblogs.com/taoshihan/p/6340854.html</a>）</li>
<li>在A端编写签名方法（就是使用公钥进行加密的过程），加密的数据可以是字符串或时间。如果是加密数据是时间，如'Y-m-d H:00:00'，代表当前整点（小时）内有效。</li>
<li>在B端获取到第1步中生成的public_key.pem，通过public_key.pem调用A端签名方法。</li>
<li>请求B端接口时，A端首先进行签名验证，验证通过则允许调用，不通过则提示错误信息。</li>
</ol>
</div>
</div>
</div>
</div>
<div id="outline-container-org53dcd3c" class="outline-2">
<h2 id="org53dcd3c">Hash算法</h2>
<div class="outline-text-2" id="text-org53dcd3c">
</div>
<div id="outline-container-org221f6f1" class="outline-3">
<h3 id="org221f6f1">说明</h3>
<div class="outline-text-3" id="text-org221f6f1">
<pre class="example">
Hash算法特别的地方在于它是一种单向算法，用户可以通过Hash算法对目标信息生成一段特定长度的唯一的Hash值，却不能通
过这个Hash值重新获得目标信息。因此Hash算法常用在不可还原的密码存储、信息完整性校验等。

</pre>

<pre class="example">
常见的Hash算法：MD5、HAVAL、SHA、HMAC、HMAC-MD5、HMAC-SHA1

</pre>
</div>
</div>
<div id="outline-container-org6256e0e" class="outline-3">
<h3 id="org6256e0e">MD5</h3>
<div class="outline-text-3" id="text-org6256e0e">
</div>
<div id="outline-container-orga4ba6fb" class="outline-4">
<h4 id="orga4ba6fb">简介</h4>
<div class="outline-text-4" id="text-orga4ba6fb">
<pre class="example">
MD5为计算机安全领域广泛使用的一种散列函数，用以提供消息的完整性保护。对MD5加密算法简要的叙述可以为：MD5以512位
分组来处理输入的信息，且每一分组又被划分为16个32位子分组，经过了一系列的处理后，算法的输出由四个32位分组组成，将
这四个32位分组级联后将生成—个128位散列值。

</pre>

<pre class="example">
MD5被广泛用于各种软件的密码认证和钥匙识别上。MD5用的是哈希函数，它的典型应用是对一段信息产生信息摘要，以防止被
篡改。

</pre>

<pre class="example">
MD5的典型应用是对一段Message产生fingerprin指纹，以防止被“篡改”。如果再有—个第三方的认证机，用MD5还可以防止文
件作者的“抵赖”，这就是所谓的数字签名应用

</pre>

<pre class="example">
MD5还广泛用于操作系统的登陆认证上，如UNIX、各类BSD系统登录密码、数字签名等诸多方。

</pre>
</div>
</div>
<div id="outline-container-org40ed75c" class="outline-4">
<h4 id="org40ed75c">C# Code</h4>
<div class="outline-text-4" id="text-org40ed75c">
<div class="org-src-container">
<pre class="src src-emacs-lisp">#region MD5&#21152;&#23494;
/// &lt;summary&gt;
/// MD5&#21152;&#23494;
/// &lt;/summary&gt;
/// &lt;param name=<span style="color: #8b2252;">"input"</span>&gt;&#38656;&#35201;&#21152;&#23494;&#30340;&#23383;&#31526;&#20018;&lt;/param&gt;
/// &lt;returns&gt;&lt;/returns&gt;
public static string MD5Encrypt(string input)
{
    return MD5Encrypt(input, new UTF8Encoding())<span style="color: #b22222;">;</span>
}

/// &lt;summary&gt;
/// MD5&#21152;&#23494;
/// &lt;/summary&gt;
/// &lt;param name=<span style="color: #8b2252;">"input"</span>&gt;&#38656;&#35201;&#21152;&#23494;&#30340;&#23383;&#31526;&#20018;&lt;/param&gt;
/// &lt;param name=<span style="color: #8b2252;">"encode"</span>&gt;&#23383;&#31526;&#30340;&#32534;&#30721;&lt;/param&gt;
/// &lt;returns&gt;&lt;/returns&gt;
public static string MD5Encrypt(string input, Encoding encode)
{
    MD5 md5 = new MD5CryptoServiceProvider()<span style="color: #b22222;">;</span>
    byte[] t = md5.ComputeHash(encode.GetBytes(input))<span style="color: #b22222;">;</span>
    StringBuilder sb = new StringBuilder(32)<span style="color: #b22222;">;</span>
    for (int i = 0<span style="color: #b22222;">; </span><span style="color: #b22222;">i &lt; t.Length; i++)</span>
        sb.Append(t[i].ToString(<span style="color: #8b2252;">"x"</span>).PadLeft(2, '0'))<span style="color: #b22222;">;</span>
        return sb.ToString()<span style="color: #b22222;">;</span>
    }

/// &lt;summary&gt;
/// MD5&#23545;&#25991;&#20214;&#27969;&#21152;&#23494;
/// &lt;/summary&gt;
/// &lt;param name=<span style="color: #8b2252;">"sr"</span>&gt;&lt;/param&gt;
/// &lt;returns&gt;&lt;/returns&gt;
public static string MD5Encrypt(Stream stream)
{
    MD5 md5serv = MD5CryptoServiceProvider.Create()<span style="color: #b22222;">;</span>
    byte[] buffer = md5serv.ComputeHash(stream)<span style="color: #b22222;">;</span>
    StringBuilder sb = new StringBuilder()<span style="color: #b22222;">;</span>
    foreach (byte var in buffer)
        sb.Append(var.ToString(<span style="color: #8b2252;">"x2"</span>))<span style="color: #b22222;">;</span>
    return sb.ToString()<span style="color: #b22222;">;</span>
}

/// &lt;summary&gt;
/// MD5&#21152;&#23494;(&#36820;&#22238;16&#20301;&#21152;&#23494;&#20018;)
/// &lt;/summary&gt;
/// &lt;param name=<span style="color: #8b2252;">"input"</span>&gt;&lt;/param&gt;
/// &lt;param name=<span style="color: #8b2252;">"encode"</span>&gt;&lt;/param&gt;
/// &lt;returns&gt;&lt;/returns&gt;
public static string MD5Encrypt16(string input, Encoding encode)
{
    MD5CryptoServiceProvider md5 = new MD5CryptoServiceProvider()<span style="color: #b22222;">;</span>
    string result = BitConverter.ToString(md5.ComputeHash(encode.GetBytes(input)), 4, 8)<span style="color: #b22222;">;</span>
    result = result.Replace(<span style="color: #8b2252;">"-"</span>, <span style="color: #8b2252;">""</span>)<span style="color: #b22222;">;</span>
    return result<span style="color: #b22222;">;</span>
}
#endregion
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd2c1264" class="outline-3">
<h3 id="orgd2c1264">SHA</h3>
<div class="outline-text-3" id="text-orgd2c1264">
</div>
<div id="outline-container-org4641a73" class="outline-4">
<h4 id="org4641a73">简介</h4>
<div class="outline-text-4" id="text-org4641a73">
<pre class="example">
SHA(Secure Hash Algorithm)是一个密码散列函数家族，是FIPS(Federal Information Processing Standards, 
联邦信息处理标准)所认证的安全散列算法。由美国国家安全局（NSA）所设计，并由美国国家标准与技术研究院（NIST）发布，
是美国的政府标准。分别是SHA-0, SHA-1, SHA-2, SHA-3，具体参考

</pre>
<ul class="org-ul">
<li><a href="https://zh.wikipedia.org/wiki/SHA%E5%AE%B6%E6%97%8F">SHA家族</a></li>
<li><a href="https://zh.wikipedia.org/wiki/SHA-3">SHA-3</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org6b7a698" class="outline-2">
<h2 id="org6b7a698">其他</h2>
<div class="outline-text-2" id="text-org6b7a698">
</div>
<div id="outline-container-org5ee4bc1" class="outline-3">
<h3 id="org5ee4bc1">Base64编码算法</h3>
<div class="outline-text-3" id="text-org5ee4bc1">
</div>
<div id="outline-container-org25d3234" class="outline-4">
<h4 id="org25d3234">简介</h4>
<div class="outline-text-4" id="text-org25d3234">
<pre class="example">
BASE64其实不是安全领域下的加密解密算法，只能算是一个编码算法。是网络上最常见的用于传输8bit字节代码的编码方式之一，
Base64编码可用于在HTTP环境下传递较长的标识信息。

</pre>

<pre class="example">
例如，在JAVAPERSISTENCE系统HIBEMATE中，采用了Base64来将一个较长的唯一标识符编码为一个字符串，用作HTTP表单和
HTTPGETURL中的参数。在其他应用程序中，也常常需要把二进制数据编码为适合放在URL（包括隐藏表单域）中的形式。此时，
采用Base64编码不仅比较简短，同时也具有不可读性，即所编码的数据不会被人用肉眼所直接看到。

</pre>
</div>
</div>
