_orgs/_posts/algorithms/2018-06-12-encrypt.org
*** C# Code
 #+BEGIN_SRC emacs-lisp
 /// <summary>
 /// 加密
 /// </summary>
 /// <param name="codeType"></param>
 /// <param name="code"></param>
 /// <returns></returns>
 public static string Base64Encrypt(string codeType,string code)
 {
     string encode = "";
     byte[] bytes = Encoding.GetEncoding(codeType).GetBytes(code);
     try
     {
         encode = Convert.ToBase64String(bytes);
     }
     catch (Exception ex)
     {
         encode = code;
     }
     return encode;
 }
 /// <summary>
 /// 解密
 /// </summary>
 /// <param name="codeType"></param>
 /// <param name="code"></param>
 /// <returns></returns>
 public static string Base64Decrypt(string codeType,string code)
 {
     string decode = "";
     byte[] bytes = Convert.FromBase64String(code); 
     try
     {
         decode = Encoding.GetEncoding(codeType).GetString(bytes); //将指定字节数组中的一个字节序列解码为一个字符串。 
     }
     catch (Exception ex)
     {
         decode = code;
     }
     return decode;
 }
 #+END_SRC
 //简写
 #+BEGIN_SRC emacs-lisp
 #region Base64加密解密
 /// <summary>
 /// Base64加密
 /// </summary>
 /// <param name="input">需要加密的字符串</param>
 /// <returns></returns>
 public static string Base64Encrypt(string input)
 {
     return Base64Encrypt(input, new UTF8Encoding());
 }

 /// <summary>
 /// Base64加密
 /// </summary>
 /// <param name="input">需要加密的字符串</param>
 /// <param name="encode">字符编码</param>
 /// <returns></returns>
 public static string Base64Encrypt(string input, Encoding encode)
 {
     return Convert.ToBase64String(encode.GetBytes(input));
 }
 
 /// <summary>
 /// Base64解密
 /// </summary>
 /// <param name="input">需要解密的字符串</param>
 /// <returns></returns>
 public static string Base64Decrypt(string input)
 {
     return Base64Decrypt(input, new UTF8Encoding());
 }
 
 /// <summary>
 /// Base64解密
 /// </summary>
 /// <param name="input">需要解密的字符串</param>
 /// <param name="encode">字符的编码</param>
 /// <returns></returns>
 public static string Base64Decrypt(string input, Encoding encode)
 {
     return encode.GetString(Convert.FromBase64String(input));
 }
 #endregion
 #+END_SRC
*** JavaScript Code
 #+BEGIN_SRC js emacs-lisp
 // private property
 var _keyStr = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/=";
 function encodeBase64(input) {
     var output = "";
     var chr1, chr2, chr3, enc1, enc2, enc3, enc4;
     var i = 0;
     input = _utf8_encode(input);
     while (i < input.length) {
         chr1 = input.charCodeAt(i++);
	 chr2 = input.charCodeAt(i++);
	 chr3 = input.charCodeAt(i++);
	 enc1 = chr1 >> 2;
	 enc2 = ((chr1 & 3) << 4) | (chr2 >> 4);
	 enc3 = ((chr2 & 15) << 2) | (chr3 >> 6);
	 enc4 = chr3 & 63;
	 if (isNaN(chr2)) {
	     enc3 = enc4 = 64;
         } else if (isNaN(chr3)) {
	     enc4 = 64;
         }
	 output +=_keyStr.charAt(enc1);
         output+= _keyStr.charAt(enc2);
         output+=_keyStr.charAt(enc3);
         output+= _keyStr.charAt(enc4);
    }
    return output;
 }
 //Base64 解密
 function decodeBase64(input) {
     var output = "";
     var chr1, chr2, chr3;
     var enc1, enc2, enc3, enc4;
     var i = 0;
     input = input.replace(/[^A-Za-z0-9\+\/\=]/g, "");
     while (i < input.length) {
         enc1 = _keyStr.indexOf(input.charAt(i++));
         enc2 = _keyStr.indexOf(input.charAt(i++));
         enc3 = _keyStr.indexOf(input.charAt(i++));
         enc4 = _keyStr.indexOf(input.charAt(i++));
         chr1 = (enc1 << 2) | (enc2 >> 4);
         chr2 = ((enc2 & 15) << 4) | (enc3 >> 2);
         chr3 = ((enc3 & 3) << 6) | enc4;
         output = output + String.fromCharCode(chr1);
         if (enc3 != 64) {
             output = output + String.fromCharCode(chr2);
         }
         if (enc4 != 64) {
             output = output + String.fromCharCode(chr3);
         }
     }
     output = _utf8_decode(output);
     return output;
 }
 // private method for UTF-8 decoding
 function _utf8_decode(utftext) {
     var string = "";
     var i = 0;
     var c = c1 = c2 = 0;
     while (i < utftext.length) {
         c = utftext.charCodeAt(i);
         if (c < 128) {
             string += String.fromCharCode(c);
             i++;
         } else if ((c > 191) && (c < 224)) {
             c2 = utftext.charCodeAt(i + 1);
             string += String.fromCharCode(((c & 31) << 6) | (c2 & 63));
             i += 2;
         } else {
             c2 = utftext.charCodeAt(i + 1);
             c3 = utftext.charCodeAt(i + 2);
             string += String.fromCharCode(((c & 15) << 12) | ((c2 & 63) << 6) | (c3 & 63));
             i += 3;
         }
     }
     return string;
 }
 #+END_SRC 
** HTTPS
: ​HTTPS（全称：Hypertext Transfer Protocol over Secure Socket Layer），是以安全为目标的HTTP通道，简单讲
: 是HTTP的安全版。即HTTP下加入SSL层，HTTPS的安全基础是SSL(SSL使用40 位关键字作为RC4流加密算法，这对于商业信息
: 的加密是合适的。)，因此加密的详细内容就需要SSL。

: https:URL表明它使用了HTTP，但HTTPS存在不同于HTTP的默认端口及一个加密/身份验证层（在HTTP与TCP之间），提供了身
: 份验证与加密通讯方法，现在它被广泛用于万维网上安全敏感的通讯，例如交易支付方面。它的主要作用可以分为两种：一种是建
: 立一个信息安全通道，来保证数据传输的安全；另一种就是确认网站的真实性。
