_posts/algorithms/2018-06-12-encrypt.html
<div id="outline-container-org2820baa" class="outline-4">
<h4 id="org2820baa">C# Code</h4>
<div class="outline-text-4" id="text-org2820baa">
<div class="org-src-container">
<pre class="src src-emacs-lisp">/// &lt;summary&gt;
/// &#21152;&#23494;
/// &lt;/summary&gt;
/// &lt;param name=<span style="color: #8b2252;">"codeType"</span>&gt;&lt;/param&gt;
/// &lt;param name=<span style="color: #8b2252;">"code"</span>&gt;&lt;/param&gt;
/// &lt;returns&gt;&lt;/returns&gt;
public static string Base64Encrypt(string codeType,string code)
{
    string encode = <span style="color: #8b2252;">""</span><span style="color: #b22222;">;</span>
    byte[] bytes = Encoding.GetEncoding(codeType).GetBytes(code)<span style="color: #b22222;">;</span>
    try
    {
        encode = Convert.ToBase64String(bytes)<span style="color: #b22222;">;</span>
    }
    catch (Exception ex)
    {
        encode = code<span style="color: #b22222;">;</span>
    }
    return encode<span style="color: #b22222;">;</span>
}
/// &lt;summary&gt;
/// &#35299;&#23494;
/// &lt;/summary&gt;
/// &lt;param name=<span style="color: #8b2252;">"codeType"</span>&gt;&lt;/param&gt;
/// &lt;param name=<span style="color: #8b2252;">"code"</span>&gt;&lt;/param&gt;
/// &lt;returns&gt;&lt;/returns&gt;
public static string Base64Decrypt(string codeType,string code)
{
    string decode = <span style="color: #8b2252;">""</span><span style="color: #b22222;">;</span>
    byte[] bytes = Convert.FromBase64String(code)<span style="color: #b22222;">; </span>
    try
    {
        decode = Encoding.GetEncoding(codeType).GetString(bytes)<span style="color: #b22222;">; </span><span style="color: #b22222;">//&#23558;&#25351;&#23450;&#23383;&#33410;&#25968;&#32452;&#20013;&#30340;&#19968;&#20010;&#23383;&#33410;&#24207;&#21015;&#35299;&#30721;&#20026;&#19968;&#20010;&#23383;&#31526;&#20018;&#12290; </span>
    }
    catch (Exception ex)
    {
        decode = code<span style="color: #b22222;">;</span>
    }
    return decode<span style="color: #b22222;">;</span>
}
</pre>
</div>
<p>
//简写
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">#region Base64&#21152;&#23494;&#35299;&#23494;
/// &lt;summary&gt;
/// Base64&#21152;&#23494;
/// &lt;/summary&gt;
/// &lt;param name=<span style="color: #8b2252;">"input"</span>&gt;&#38656;&#35201;&#21152;&#23494;&#30340;&#23383;&#31526;&#20018;&lt;/param&gt;
/// &lt;returns&gt;&lt;/returns&gt;
public static string Base64Encrypt(string input)
{
    return Base64Encrypt(input, new UTF8Encoding())<span style="color: #b22222;">;</span>
}

/// &lt;summary&gt;
/// Base64&#21152;&#23494;
/// &lt;/summary&gt;
/// &lt;param name=<span style="color: #8b2252;">"input"</span>&gt;&#38656;&#35201;&#21152;&#23494;&#30340;&#23383;&#31526;&#20018;&lt;/param&gt;
/// &lt;param name=<span style="color: #8b2252;">"encode"</span>&gt;&#23383;&#31526;&#32534;&#30721;&lt;/param&gt;
/// &lt;returns&gt;&lt;/returns&gt;
public static string Base64Encrypt(string input, Encoding encode)
{
    return Convert.ToBase64String(encode.GetBytes(input))<span style="color: #b22222;">;</span>
}

/// &lt;summary&gt;
/// Base64&#35299;&#23494;
/// &lt;/summary&gt;
/// &lt;param name=<span style="color: #8b2252;">"input"</span>&gt;&#38656;&#35201;&#35299;&#23494;&#30340;&#23383;&#31526;&#20018;&lt;/param&gt;
/// &lt;returns&gt;&lt;/returns&gt;
public static string Base64Decrypt(string input)
{
    return Base64Decrypt(input, new UTF8Encoding())<span style="color: #b22222;">;</span>
}

/// &lt;summary&gt;
/// Base64&#35299;&#23494;
/// &lt;/summary&gt;
/// &lt;param name=<span style="color: #8b2252;">"input"</span>&gt;&#38656;&#35201;&#35299;&#23494;&#30340;&#23383;&#31526;&#20018;&lt;/param&gt;
/// &lt;param name=<span style="color: #8b2252;">"encode"</span>&gt;&#23383;&#31526;&#30340;&#32534;&#30721;&lt;/param&gt;
/// &lt;returns&gt;&lt;/returns&gt;
public static string Base64Decrypt(string input, Encoding encode)
{
    return encode.GetString(Convert.FromBase64String(input))<span style="color: #b22222;">;</span>
}
#endregion
</pre>
</div>
</div>
</div>
<div id="outline-container-org35fa06d" class="outline-4">
<h4 id="org35fa06d">JavaScript Code</h4>
<div class="outline-text-4" id="text-org35fa06d">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #b22222;">// </span><span style="color: #b22222;">private property</span>
<span style="color: #a020f0;">var</span> <span style="color: #a0522d;">_keyStr</span> = <span style="color: #8b2252;">"ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/="</span>;
<span style="color: #a020f0;">function</span> <span style="color: #0000ff;">encodeBase64</span>(<span style="color: #a0522d;">input</span>) {
    <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">output</span> = <span style="color: #8b2252;">""</span>;
    <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">chr1</span>, <span style="color: #a0522d;">chr2</span>, <span style="color: #a0522d;">chr3</span>, <span style="color: #a0522d;">enc1</span>, <span style="color: #a0522d;">enc2</span>, <span style="color: #a0522d;">enc3</span>, <span style="color: #a0522d;">enc4</span>;
    <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">i</span> = 0;
    input = _utf8_encode(input);
    <span style="color: #a020f0;">while</span> (i &lt; input.length) {
        chr1 = input.charCodeAt(i++);
        chr2 = input.charCodeAt(i++);
        chr3 = input.charCodeAt(i++);
        enc1 = chr1 &gt;&gt; 2;
        enc2 = ((chr1 &amp; 3) &lt;&lt; 4) | (chr2 &gt;&gt; 4);
        enc3 = ((chr2 &amp; 15) &lt;&lt; 2) | (chr3 &gt;&gt; 6);
        enc4 = chr3 &amp; 63;
        <span style="color: #a020f0;">if</span> (isNaN(chr2)) {
            enc3 = enc4 = 64;
        } <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (isNaN(chr3)) {
            enc4 = 64;
        }
        output +=_keyStr.charAt(enc1);
        output+= _keyStr.charAt(enc2);
        output+=_keyStr.charAt(enc3);
        output+= _keyStr.charAt(enc4);
   }
   <span style="color: #a020f0;">return</span> output;
}
<span style="color: #b22222;">//</span><span style="color: #b22222;">Base64 &#35299;&#23494;</span>
<span style="color: #a020f0;">function</span> <span style="color: #0000ff;">decodeBase64</span>(<span style="color: #a0522d;">input</span>) {
    <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">output</span> = <span style="color: #8b2252;">""</span>;
    <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">chr1</span>, <span style="color: #a0522d;">chr2</span>, <span style="color: #a0522d;">chr3</span>;
    <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">enc1</span>, <span style="color: #a0522d;">enc2</span>, <span style="color: #a0522d;">enc3</span>, <span style="color: #a0522d;">enc4</span>;
    <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">i</span> = 0;
    input = input.replace(<span style="color: #8b2252;">/[^A-Za-z0-9\+\/\=]/</span>g, <span style="color: #8b2252;">""</span>);
    <span style="color: #a020f0;">while</span> (i &lt; input.length) {
        enc1 = _keyStr.indexOf(input.charAt(i++));
        enc2 = _keyStr.indexOf(input.charAt(i++));
        enc3 = _keyStr.indexOf(input.charAt(i++));
        enc4 = _keyStr.indexOf(input.charAt(i++));
        chr1 = (enc1 &lt;&lt; 2) | (enc2 &gt;&gt; 4);
        chr2 = ((enc2 &amp; 15) &lt;&lt; 4) | (enc3 &gt;&gt; 2);
        chr3 = ((enc3 &amp; 3) &lt;&lt; 6) | enc4;
        output = output + String.fromCharCode(chr1);
        <span style="color: #a020f0;">if</span> (enc3 != 64) {
            output = output + String.fromCharCode(chr2);
        }
        <span style="color: #a020f0;">if</span> (enc4 != 64) {
            output = output + String.fromCharCode(chr3);
        }
    }
    output = _utf8_decode(output);
    <span style="color: #a020f0;">return</span> output;
}
<span style="color: #b22222;">// </span><span style="color: #b22222;">private method for UTF-8 decoding</span>
<span style="color: #a020f0;">function</span> <span style="color: #0000ff;">_utf8_decode</span>(<span style="color: #a0522d;">utftext</span>) {
    <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">string</span> = <span style="color: #8b2252;">""</span>;
    <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">i</span> = 0;
    <span style="color: #a020f0;">var</span> <span style="color: #a0522d;">c</span> = c1 = c2 = 0;
    <span style="color: #a020f0;">while</span> (i &lt; utftext.length) {
        c = utftext.charCodeAt(i);
        <span style="color: #a020f0;">if</span> (c &lt; 128) {
            string += String.fromCharCode(c);
            i++;
        } <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> ((c &gt; 191) &amp;&amp; (c &lt; 224)) {
            c2 = utftext.charCodeAt(i + 1);
            string += String.fromCharCode(((c &amp; 31) &lt;&lt; 6) | (c2 &amp; 63));
            i += 2;
        } <span style="color: #a020f0;">else</span> {
            c2 = utftext.charCodeAt(i + 1);
            c3 = utftext.charCodeAt(i + 2);
            string += String.fromCharCode(((c &amp; 15) &lt;&lt; 12) | ((c2 &amp; 63) &lt;&lt; 6) | (c3 &amp; 63));
            i += 3;
        }
    }
    <span style="color: #a020f0;">return</span> string;
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgdea386d" class="outline-3">
<h3 id="orgdea386d">HTTPS</h3>
<div class="outline-text-3" id="text-orgdea386d">
<pre class="example">
​HTTPS（全称：Hypertext Transfer Protocol over Secure Socket Layer），是以安全为目标的HTTP通道，简单讲
是HTTP的安全版。即HTTP下加入SSL层，HTTPS的安全基础是SSL(SSL使用40 位关键字作为RC4流加密算法，这对于商业信息
的加密是合适的。)，因此加密的详细内容就需要SSL。

</pre>

<pre class="example">
https:URL表明它使用了HTTP，但HTTPS存在不同于HTTP的默认端口及一个加密/身份验证层（在HTTP与TCP之间），提供了身
份验证与加密通讯方法，现在它被广泛用于万维网上安全敏感的通讯，例如交易支付方面。它的主要作用可以分为两种：一种是建
立一个信息安全通道，来保证数据传输的安全；另一种就是确认网站的真实性。

</pre>
</div>
</div>
</div>
