_orgs/_posts/algorithms/2018-06-12-encrypt.org
* 总结
1. 加密算法是可逆的，用来对敏感数据进行保护。散列算法(签名算法、哈希算法)是不可逆的，主要用于身份验证。
2. 对称加密算法使用同一个密匙加密和解密，速度快，适合给大量数据加密。对称加密客户端和服务端使用同一个密匙，存在被抓包破解的风险。
3. 非对称加密算法使用公钥加密，私钥解密，私钥签名，公钥验签。安全性比对称加密高，但速度较慢。非对称加密使用两个密匙，服务端和客户端密匙不一样，私钥放在服务端，黑客一般是拿不到的，安全性高。
4. Base64不是安全领域下的加解密算法，只是一个编码算法，通常用于把二进制数据编码为可写的字符形式的数据，特别适合在http，mime协议下的网络快速传输数据。UTF-8和GBK中文的Base64编码结果是不同的。采用Base64编码不仅比较简短，同时也具有不可读性，即所编码的数据不会被人用肉眼所直接看到，但这种方式很初级，很简单。Base64可以对图片文件进行编码传输。
5. https协议广泛用于万维网上安全敏感的通讯，例如交易支付方面。它的主要作用可以分为两种：一种是建立一个信息安全通道，来保证数据传输的安全；另一种就是确认网站的真实性。
6. 大量数据加密建议采用对称加密算法，提高加解密速度；小量的机密数据，可以采用非对称加密算法。在实际的操作过程中，我们通常采用的方式是：采用非对称加密算法管理对称算法的密钥，然后用对称加密算法加密数据，这样我们就集成了两类加密算法的优点，既实现了加密速度快的优点，又实现了安全方便管理密钥的优点。
7. MD5标准密钥长度128位（128位是指二进制位。二进制太长，所以一般都改写成16进制，每一位16进制数可以代替4位二进制数，所以128位二进制数写成16进制就变成了128/4=32位。16位加密就是从32位MD5散列中把中间16位提取出来）；sha1标准密钥长度160位(比MD5摘要长32位)，Base64转换后的字符串理论上将要比原来的长1/3。
* 参考资料
- [[https://blog.csdn.net/zuiyuezhou888/article/details/7557050][常见加密算法分类]]
- [[https://blog.csdn.net/qq_21794823/article/details/53114819][常见加密算法分类,用途,原理以及比较]]
- [[https://www.bbsmax.com/A/xl56xMRkzr/][JS实现base64加密解密]]
- [[http://www.cnblogs.com/zyw-205520/p/5585014.html][几种常用加密算法比较]]
- [[https://zh.wikipedia.org/wiki/SHA%E5%AE%B6%E6%97%8F][SHA家族]]
- [[http://www.cnblogs.com/malaohu/p/3214136.html][C# 加密解密(DES,3DES,MD5,Base64)类]]
- [[http://www.it610.com/article/1219677.htm][c# base64算法解密]]
- [[https://zh.wikipedia.org/wiki/%E5%AF%86%E7%A0%81%E5%AD%A6][密码学]]
- [[https://www.cnblogs.com/sochishun/p/7028056.html][加密算法(DES,AES,RSA,MD5,SHA1,Base64)比较和项目应用]]
